Repository: gbif/doc-documentation-guidelines
Catalog: po/*.po
Languages: da

source: GBIF Documentation Guidelines
da: GBIF-dokumentationsretningslinjer

source: https://www.gbif.org/occurrence/1265538197[_Cyperus papyrus_ L.], observed in Mexico by Alfonso Gutiérrez Aldana. Photo (via iNaturalist) licensed under http://creativecommons.org/licenses/by-nc/4.0/[CC BY-NC 4.0].
da: https://www.gbif.org/occurrence/1265538197[_Cyperus papyrus_ L.], observeret i Mexico af Alfonso Gutiérrez Aldana. Foto (via iNaturalist) licenseret under http://creativecommons.org/licenses/by-nc/4.0/[CC BY-NC 4.0].

source: Photograph of _Cyperus papyrus_ L.
da: Foto af _Cyperus papyrus_ L.

source: Guidelines for authoring GBIF documentation.
da: Retningslinjer for oprettelse af GBIF-dokumentation.

source: *Placeholder text, this document is not yet written!*
da: *Stedholdertekst, dette dokument er endnu ikke skrevet*

source: Source code
da: Kildekode

source: Repositories are stored in GitHub, and the source code files can be edited within the Github interface, or on a computer (including when offline) using Git. Many tutorials for using both Git and Github are available on the web.
da: Opbevaringssteder gemmes i GitHub, og kildekodefilerne kan redigeres i Github-grænsefladen eller på en computer (herunder når offline) ved hjælp af Git. Mange tutorials til brug af både Git og GitHub er tilgængelige på internettet.

source: Files in the repository with the file extension `.adoc` are the source code for the document. The file `index.adoc` is the index page, it must contain (usually with the `include` command) all parts of the document.
da: Filer i depotet med filtypen `.adoc` er kildekoden for dokumentet. Filen `index.adoc` er indekssiden, den skal indeholde (som regel med kommandoen `include`) alle dele af dokumentet.

source: The document is built using _Asciidoctor_, a document format which uses plain text formatting to describe the document's structure, and allow a style to be applied automatically. For information on the syntax, see the https://asciidoctor.org/docs/user-manual/[Asciidoctor User Manual].
da: Dokumentet er bygget ved hjælp af _Asciidoctor_, et dokumentformat, der bruger almindelig tekstformatering til at beskrive dokumentets struktur og tillade, at en stil anvendes automatisk. For information om syntak\ sen, se https://asciidoctor.org/docs/user-manual/[Asciidoctor Brugervejledning].

source: Generating the document
da: Generering af dokumentet

source: The source code in the document repositories is converted into the finished HTML and PDF documents using the _Asciidoctor_ tool. Every time a change is made to a repository, the GBIF build server is notified. It retrieves the source code, generates the documents, and copies the formatted documents to a webserver.
da: Kildekoden i dokumentarkiverne konverteres til de færdige HTML- og PDF-dokumenter ved hjælp af _Asciidoctor_-værktøjet. Hver gang en ændring er foretaget i et depot, bliver GBIF build-serveren underrettet. Den henter kildekoden, genererer dokumenterne og kopierer de formaterede dokumenter til en webserver.

source: A log file of recent builds is kept by the build server. If there is a syntax error preventing the document from being generated, you will need to inspect the log file to see what the problem is.
da: En logfil af nyere bygninger opbevares af build-serveren. Hvis der er en syntaksfejl, der forhindrer dokumentet i at blive genereret, skal du inspicere logfilen for at se, hvad problemet er.

source: Local document build
da: Lokalt dokumentbygning

source: If you are familiar with software development tools, you can build a document on your own computer – this is useful for previewing changes. You can build the HTML document with this command, run from the top level directory:
da: Hvis du er bekendt med softwareudviklingsværktøjer, kan du opbygge et dokument på din egen computer - dette er nyttigt til forhåndsvisning af ændringer. Du kan opbygge HTML-dokumentet med denne kommando, køre fra øverste niveau bibliotek:

source: To create the PDF document, use `asciidoctor-pdf` rather than `asciidoctor`. The result is called either `index.html` or `index.pdf`.
da: For at oprette PDF-dokumentet, brug `asciidoctor-pdf` snarere end` asciidoctor`. Resultatet hedder enten `index.html` eller `index.pdf`.

source: Available documents
da: Tilgængelige dokumenter

source: *Effective nodes guidance* https://github.com/gbif/doc-effective-nodes-guidance[EN] | link:#[ES] | | link:#[ES] | | link:#[PT]
da: *Effektiv noder vejledning* https://github.com/gbif/doc-effective-nodes-guidance[EN] | link:#[ES] | | link:#[ES] | | link:#[PT]

source: https://github.com/gbif/doc-georeferencing-quick-guide[Georeferencing Quick Guide]
da: https://github.com/gbif/doc-georeferencing-quick-guide[Georeferencing hurtig guide]
